{
  "habo": {
    "name": "HABO",
    "description":["USER: demo PASSWORD: habodemo", "HABO is a personal project of mine to help Starbucks baristas communicate shift trades better among their coworkers and the community at large. Having worked at Starbucks for some time, I have intimate knowledge of the UX I desire and logistical problems I face, as well as the passion to move forward", "This demo project is built with a basic installation of Drupal 7. Some features I currently have enabled include Geograhical organization, custom content-types, Drupal Rules, custom modules, and fairly extensive use of views for organizing shifts available for trade.", "Feel free to log in with the demo account and post a shift. (Note, all posts delete after 30 days by design, so sample data may be scarce).", "As of March 2018, I have begun working on an entirely new and decoupled version in Drupal 8 and React Native."],
    "repoURL": "https://github.com/cmartinez84/UpShift",
    "liveURL": "https://live-habo.pantheonsite.io/",
    "imageURL": "screenshots/Habo.png",
    "technologies": ["Drupal", "PHP"]
  },
  "blorpr": {
    "name": "Blorplr",
    "description": ["The assignment was to make a question and answer board using  Ember.js, demonstrating an assortment of Ember's features, including nested routing, helpers, computed properties, and working with an API call to and maintaining a Firebase database. I created a custom five-star rating system with CSS hover effects and an option to either create basic member profiles-through simple database queries- or to post anonymously"],
    "repoURL": "https://github.com/cmartinez84/forum-with-ember",
    "liveURL": "https://blorplr.herokuapp.com/",
    "imageURL" : "screenshots/blorplr.png",
    "technologies": ["Ember.js", "Firebase"]

  },
  "shoppr": {
    "name": "Shoppr",
    "description":[ "Shoppr is a grocery store app we created as a final group project for PHP at Epicodus, using the Silex micro-framework and Twig templating. Shoppr allows customers to shop and search for groceries, create a virtual shopping cart, view personal shopping history, and receive emails for both registration and receipts. In addition to customer roles, the app contains a UI for full admin privileges, including, inventory, pricing and product information. Other features include email confirmations for registration viewing privileges based on roles, from admin to anonymous users.",
    "This project contains a simulation for future integration of actual credit card processing services and managing member accounts. All of these features were coded without the use of a Content Management System!"],
    "repoURL" : "https://github.com/cmartinez84/grocery-store-app",
    "liveURL" : "",
    "imageURL": "screenshots/shoppr.png",
    "technologies": ["PHP", "Silex", "MySQL"]
  },
  "telephoto":{
    "name": "Telephoto",
    "description": ["The assignment was to practice API calls and build a site with Node.js. What resulted was a game of free association, where a user clicks on an image to generate tags, which in turn brings up similar images, with the goal of trying to obtain a picture with a destination tag in 15 clicks of less. The game uses two APIs: one to generate tags and the other to generate images."],
    "repoURL": "https://github.com/chrismartinez84/telephoto",
    "liveURL": "https://chrismartinez84.github.io/telephoto/",
    "imageURL": "screenshots/telephoto.png",
    "technologies" : ["Node", "Javascript", "Firebase"]
  },
  "Recentia": {
    "name" : "Recentia Health",
    "description": ["During my internship with Recentia Health, my team was tasked with creating an interface for inputting patient problems and organizing patient history using Angular. Our project involved establishing and represnting relationships between medical problems, filtering patient data, and API calls to clinical guideline services."],
    "repoURL": "https://github.com/cmartinez84/RHP-problems-list/tree/master/src/app",
    "liveURL": "null",
    "imageURL": "screenshots/recentia.png",
    "technologies": ["Angular 4"]
  },
  "Portfolio": {
    "name": "portfolio",
    "description": ["When redoing my portfolio, I decided to utilize some of the technologies I've been exploring since graduating from Epicodus. I began building my new site with create-react-app and use the Web Audio API to handle some light sound effects. I built a RESTful API with Express.js on another domain to validate and handle emails from the contact form.  My email server uses the reCAPTCHA, Nodemailer, and SendGrid's SMTP relay service."],
    "repoURL":  "https://github.com/cmartinez84/react-portfolio",
    "liveURL": "https://chrismartinez.herokuapp.com/",
    "imageURL": "screenshots/portfolio.png",
    "technologies": ["React", "Web Audio API", "Express"]
  }
}
